# 2. Представлен список чисел. Необходимо вывести элементы исходного списка,
# значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

Input_list = [3, 4, 55, 66, 4, 8, 9, 12]
Output_list = [itm for id, itm in enumerate(Input_list) if id and itm > Input_list[id - 1]]
print(Output_list)
